app/views/admin/end_users.html.erb

SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = $1 LIMIT 1  [["user_id", 3]]
---
                        <td><%= us.verified ? 'Yes' : 'No' %></td>
                        <td><%= us.credit.present? ? us.credit.points : 0%></td>