app/views/admin/restaurant_detail.html.erb

                <tbody>
                  <% @restaurant.checkins.each do |us| %>
---
SELECT "checkins".* FROM "checkins" WHERE "checkins"."restaurant_id" = $1  [["restaurant_id", 31]]

                <tbody>
                  <% @restaurant.credit_histories.each do |us| %>
---
SELECT "credit_histories".* FROM "credit_histories" WHERE "credit_histories"."restaurant_id" = $1  [["restaurant_id", 31]]