app/views/admin/restaurant_users.html.erb

                        <td><%= us.verified ? 'Yes' : 'No' %></td>
                        <td><% restu = Restaurant.approved.where(owner_id: us.id) %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."approved" = $1 AND "restaurants"."owner_id" = $2  [["approved", "t"], ["owner_id", 109]]