app/views/admin/user_posts.html.erb

SELECT  "checkins".* FROM "checkins" WHERE "checkins"."post_id" = $1 LIMIT 1  [["post_id", 3]]
---
                      <td><%= us.status %></td>
                      <td><%= us.checkin.present? ? us.checkin.address : 'No' %></td>