app/views/restaurant_admin/food_items.html.erb

                <%= label 'Section' , 'section' %>
                <%= select_tag(:menu_section, options_for_select(@restaurant.menu.sections.map {|s| [s.title, s.id]}), { class: 'form-control select2' , style: 'width: 100%' }) %>
---
SELECT  "menus".* FROM "menus" WHERE "menus"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 17]]
SELECT "sections".* FROM "sections" WHERE "sections"."menu_id" = $1  [["menu_id", 10]]

                <%= label 'Caegories' , 'categories' %>
                <%= select_tag(:categories, options_for_select(Category.all.map {|s| [s.name, s.id]}), {:multiple => true , class: 'form-control select2' , style: 'width: 100%' }) %>
---
SELECT "categories".* FROM "categories"

                                    <%= label 're_categories' , 'Remove Categories' %>
                                    <%= select_tag(:re_categories, options_for_select(us.food_items[temp].categories.map {|s| [s.name, s.id]}), {:multiple => true , class: 'form-control select2' , style: 'width: 100%' }) %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_food_items" ON "categories"."id" = "categories_food_items"."category_id" WHERE "categories_food_items"."food_item_id" = $1  [["food_item_id", 12]]