app/controllers/admin_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
	def index
		@restaurant = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."approved" = $1  [["approved", "f"]]
---
	def rest_pending
		@restaurant = Restaurant.where(approved: false)

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 0]]
---
	def end_users
		@user = User.where(role: 0)

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 1]]
---
	def restaurant_users
		@user = User.where(role: 1)

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 3]]
---
	def pundit
		@user = User.where(role: 3)

SELECT "reviews".* FROM "reviews"
---
	def alL_reviews
		@review = Review.all

SELECT "checkins".* FROM "checkins"
---
	def user_checkins
		@checkin = Checkin.all

SELECT "posts".* FROM "posts"
---
	def user_posts
		@post = Post.all

SELECT "credit_histories".* FROM "credit_histories"
SELECT "credits"."points" FROM "credits"
---
	def credit_history
		@history = CreditHistory.all
		@flaot = Credit.pluck(:points).inject(0){|sum,x| sum + x }

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 31]]
---
	def restaurant_detail
		@restaurant = Restaurant.find(params[:id])

SELECT  "versions".* FROM "versions"  ORDER BY "versions"."id" DESC LIMIT 1
---
	def give_user_credit
		@version = Version.last

SELECT  "credits".* FROM "credits" WHERE "credits"."user_id" = $1 LIMIT 1  [["user_id", 163]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 100]]
UPDATE "credits" SET "points" = $1, "updated_at" = $2 WHERE "credits"."id" = $3  [["points", 28201], ["updated_at", "2016-11-11 17:42:39.565822"], ["id", 118]]
---
	def credits_sent
		if params[:user_id].present? && params[:credit].present?
			if u = User.find(params[:user_id])
				c = u.credit
				c.points = c.points + params[:credit].to_i
				c.save

SELECT COUNT(*) FROM "versions"
INSERT INTO "versions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-11-14 18:27:58.590244"], ["updated_at", "2016-11-14 18:27:58.590244"]]
SELECT  "versions".* FROM "versions"  ORDER BY "versions"."id" DESC LIMIT 1
UPDATE "versions" SET "version" = $1, "force" = $2, "updated_at" = $3 WHERE "versions"."id" = $4  [["version", "1.25.26.25"], ["force", "t"], ["updated_at", "2016-11-14 18:34:45.287162"], ["id", 1]]
---
	def set_version
		c = Version.all.count
		vc = false
		if params[:force] == 'yes'
			vc = true
		end
		if c == 0
			Version.create(version: params[:version] , force: vc)
		else
			ve = Version.last
			ve.update(version: params[:version] , force: vc)