app/controllers/newsfeed_controller.rb

	def index
		user = @current_user
		if user.newsfeed.present?
			tot_review = Hash.new
		    tot_review["Review"] =  []
		    tot_review["Checkin"] = []
		    rev_id = []
		    chk_id = []
		    days_for_review = 30
		    days_less = Time.now
		    count = 0
		    while((tot_review["Review"].length + tot_review["Checkin"].length) < 40 && count < 11)
				#user.newsfeed.ids.each do |use|
					Review.where(reviewer_id: user.newsfeed.ids).where("created_at >= ?", days_for_review.days.ago).where("created_at < ?", days_less).each do |review|
						unless rev_id.include?(review.id)
						    rev_id << review.id
						    tot_review["Review"] << ReviewUserSerializer.new(review , scope: {option_name: @current_user} )
						end
					end
					Post.where(user_id: user.newsfeed.ids).where("created_at >= ?", days_for_review.days.ago).where("created_at < ?", days_less).each do |post|
						unless chk_id.include?(post.id)
							chk_id << post.id
						   tot_review["Checkin"] << PostUserSerializer.new(post , scope: {option_name: @current_user})
						end
					end
				#end
				#user.newsfeed.rest_ids.each do |use|
					Review.where(reviewable_type: 'Restaurant').where(reviewable_id: user.newsfeed.rest_ids).where("created_at >= ?", days_for_review.days.ago).where("created_at < ?", days_less).each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reviewer_id" = 84 AND (created_at >= '2016-10-17 00:51:20.982902') AND (created_at < '2016-11-16 00:51:20.960767')
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 84 AND (created_at >= '2016-10-17 00:51:21.229337') AND (created_at < '2016-11-16 00:51:20.960767')
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reviewable_type" = $1 AND 1=0 AND (created_at >= '2016-10-17 00:51:21.288183') AND (created_at < '2016-11-16 00:51:20.960767')  [["reviewable_type", "Restaurant"]]

	def localfeed_updated
		tot_review = Hash.new
	    tot_review["Checkin"] = []
	    tot_review["Review"] = []
	    offseti = 0
	    if params[:offset].present?
	    	offseti = params[:offset]
	    end

	    ue = nil
		has = request.headers.env.select{|k, _| k =~ /^HTTP_/}
		if has["HTTP_AUTHORIZATION"].present?
			a = has["HTTP_AUTHORIZATION"].split('Token token=')[1]
			iden = Identity.find_by_token(a)
			if iden
				ue = iden.user
			end
		end

		rev = Review.all.order(created_at: 'DESC').limit(5).offset(offseti)
		rev.each do |revie|
			tot_review["Review"] << ReviewUserSerializer.new(revie , scope: {option_name: ue} )
		end
		Post.all.order(created_at: 'DESC').limit(5).offset(offseti).each do |post|
---
SELECT  "identities".* FROM "identities" WHERE "identities"."token" = $1 LIMIT 1  [["token", "twsaiswahtter185792632340897"]]
SELECT  "reviews".* FROM "reviews"  ORDER BY "reviews"."created_at" DESC LIMIT 5 OFFSET 0
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 5 OFFSET 0