app/controllers/restaurant_admin_controller.rb

	def index
		@restaurant = Restaurant.where(owner_id: @current_user.id)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."owner_id" = $1  [["owner_id", 100]]

	def restaurant_detail
		if @current_user.role == 'admin'
			@restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 31]]

	def check
		p params
		if params[:image].present?
			restaurant = Restaurant.new(name: params[:name] , typee: params[:typee] , location: params[:location] , opening_time: params[:opening_time].first , closing_time: params[:closing_time].first , per_head: params[:cost])
			restaurant.owner_id = @owner.id
			if restaurant.save
		        c_image = CoverImage.create(:image => params[:image][:image] , :restaurant_id => restaurant.id)
		        if params[:call_now].present?
		        	cal = CallNow.create(:number => params[:call_now] , :restaurant_id => restaurant.id)
---
INSERT INTO "restaurants" ("name", "typee", "location", "opening_time", "closing_time", "per_head", "owner_id", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "cover_images" ("image", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["image", "k66rvwwas5lnksxcvyxg.jpg"], ["restaurant_id", 32], ["created_at", "2016-11-15 18:47:35.284572"], ["updated_at", "2016-11-15 18:47:35.284572"]]
INSERT INTO "call_nows" ("number", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", "+923338"], ["restaurant_id", 32], ["created_at", "2016-11-15 18:47:42.148505"], ["updated_at", "2016-11-15 18:47:42.148505"]]

	def update_rest
		p params
		if @current_user.role == 'admin'
			res = Restaurant.find(params[:id])
		else
			res = Restaurant.where(owner_id: @current_user.id).find(params[:id])
		end
		res.update(rest_update_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 17]]
UPDATE "restaurants" SET "opening_time" = $1, "closing_time" = $2, "latitude" = $3, "updated_at" = $4 WHERE "restaurants"."id" = $5  [["opening_time", "2016-11-21 12:00:00.000000"], ["closing_time", "2016-11-21 00:00:00.000000"], ["latitude", 31.55460609999999], ["updated_at", "2016-11-21 14:08:29.964756"], ["id", 250]]

	def add_food_item
		p params
		if params[:name].present? && params[:fooditem][:price].present? && ( params[:section].present? || params[:menu_section].present? )
			cat_foo = false
			if @current_user.role == 'admin'
				restaurant = Restaurant.find(params[:restaurant_id])
			else
				restaurant = Restaurant.where(owner_id: @current_user.id).find(params[:restaurant_id])
			end
			if restaurant.menu.nil?
				menur = Menu.create(name: 'Menu', summary: 'Menu', restaurant_id: restaurant.id)
			else
				menur = restaurant.menu
			end

			if params[:section].present?
				if menur.sections.where(title: params[:section]).count > 0
					sec = menur.sections.find_by_title(params[:section])
				else
					sec = Section.create(title: params[:section] , menu_id: menur.id)
				end
			else
				sec = menur.sections.find(params[:menu_section])
			end
			fooditem = FoodItem.create(name: params[:name], price: params[:fooditem][:price], section_id: sec.id)

			if params[:categories].present?
				params[:categories].each do |cat|
					fooditem.categories << Category.find(cat.to_i)
---
SELECT  "sections".* FROM "sections" WHERE "sections"."menu_id" = $1 AND "sections"."id" = $2 LIMIT 1  [["menu_id", 4], ["id", 4]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "menus".* FROM "menus" WHERE "menus"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 10]]
INSERT INTO "categories_food_items" ("food_item_id", "category_id") VALUES ($1, $2)  [["food_item_id", 18], ["category_id", 4]]
INSERT INTO "food_items" ("name", "price", "section_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asd"], ["price", 145.0], ["section_id", 4], ["created_at", "2016-11-16 15:31:57.445215"], ["updated_at", "2016-11-16 15:31:57.445215"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 4]]

	def food_items
		p params
		if @current_user.role == 'admin'
			@restaurant = Restaurant.find(params[:id])
		else
			@restaurant = Restaurant.where(owner_id: @current_user.id).find(params[:id])
		end
		unless @restaurant.menu.nil?
			@food_items = @restaurant.menu.sections
		else
			sumr = @restaurant.name + ' menu'
			menu = Menu.create(name: 'Menu' , summary: sumr, restaurant_id: @restaurant.id)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 17]]
INSERT INTO "menus" ("name", "summary", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Menu"], ["summary", "Dumpukht Kada menu"], ["restaurant_id", 17], ["created_at", "2016-11-15 13:34:00.067562"], ["updated_at", "2016-11-15 13:34:00.067562"]]

	def update_fooditems
		p params
		food = FoodItem.find(params[:id])
---
SELECT  "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT 1  [["id", 12]]

	def notifications
		if @current_user.role == 'admin'
			@restaurant = Restaurant.find(params[:id])
		else
			@restaurant = Restaurant.where(owner_id: @current_user.id).find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."owner_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["owner_id", 100], ["id", 17]]

	def seen_notification
		@notification = Notification.find(params[:id])
		unless @notification.seen
			@notification.update(seen: true)
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT 1  [["id", 118]]
UPDATE "notifications" SET "seen" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["seen", "t"], ["updated_at", "2016-11-16 15:35:27.592697"], ["id", 118]]

	def qrcode
		if @current_user.role == 'admin'
			@restaurant = Restaurant.find(params[:id])
		else
			@restaurant = Restaurant.where(owner_id: @current_user.id).find(params[:id])
		end
		@qrcode = @restaurant.qrcodes.order(created_at: 'DESC')
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."owner_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["owner_id", 100], ["id", 31]]
SELECT "qrcodes".* FROM "qrcodes" WHERE "qrcodes"."restaurant_id" = $1  ORDER BY "qrcodes"."created_at" DESC  [["restaurant_id", 17]]

	def qrdetail
		@qr = Qrcode.find(params[:id])
		if @current_user.role == 'admin'
			@qrcode = @qr.credit_histories
		else
			@qrcode = Restaurant.where(owner_id: @current_user.id).find(@qr.restaurant.id).qrcodes.find(params[:id]).credit_histories
---
SELECT  "qrcodes".* FROM "qrcodes" WHERE "qrcodes"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."owner_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["owner_id", 100], ["id", 31]]

	def del_qrcode
		@qr = Qrcode.find(params[:id])
		if @current_user.role == 'admin'
			@qr.destroy
---
SELECT  "qrcodes".* FROM "qrcodes" WHERE "qrcodes"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "qrcodes" WHERE "qrcodes"."id" = $1  [["id", 7]]