app/controllers/restaurants_controller.rb

	def social
		restaurant = Restaurant.approved.find_by_id(params[:id])
		ue = nil
		has = request.headers.env.select{|k, _| k =~ /^HTTP_/}
		if has["HTTP_AUTHORIZATION"].present?
			a = has["HTTP_AUTHORIZATION"].split('Token token=')[1]
			iden = Identity.find_by_token(a)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."approved" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["approved", "t"], ["id", 6]]
SELECT  "identities".* FROM "identities" WHERE "identities"."token" = $1 LIMIT 1  [["token", "twsaiswahtter185792632340897"]]

	def nearby
		p params
		if params[:lat].present? && params[:long].present?
			res = Restaurant.approved.near([params[:lat], params[:long]], 20, :units => :km).limit(30)
---
SELECT restaurants.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((31.5 - restaurants.latitude) * PI() / 180 / 2), 2) + COS(31.5 * PI() / 180) * COS(restaurants.latitude * PI() / 180) * POWER(SIN((74.3 - restaurants.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((restaurants.longitude - 74.3) / 57.2957795), ((restaurants.latitude - 31.5) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "restaurants" WHERE (restaurants.latitude BETWEEN 31.320135678816253 AND 31.679864321183747 AND restaurants.longitude BETWEEN 74.08905014248302 AND 74.51094985751698 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((31.5 - restaurants.latitude) * PI() / 180 / 2), 2) + COS(31.5 * PI() / 180) * COS(restaurants.latitude * PI() / 180) * POWER(SIN((74.3 - restaurants.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20)  ORDER BY distance ASC