app/controllers/search_controller.rb

	def search
		if params[:name].present?
			tot_review = Hash.new
		    tot_review["res"] =  []
		    tot_review["usr"] = []
			use = User.where(role: 0).where("name ~* ?", params[:name]).limit(5)
			res = Restaurant.approved.where("name ~* ?", params[:name]).limit(5)
---
SELECT  "users".* FROM "users" WHERE "users"."role" = $1 AND (name ~* 'd') LIMIT 5  [["role", 0]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."approved" = $1 AND (name ~* 'd') LIMIT 5  [["approved", "t"]]

	def find_fb_friends
		p params[:user]
		p "Parsing"
		ar = JSON.parse(params[:user])
		us = []
		ar.each do |useri|
			user_a = Identity.where(provider: 'Facebook').where(uid: useri)
			if user_a.count > 0
				user = user_a.first.user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 85]]

	def sec_search
		if params[:name].present?
			p "Searching Sections"
			arr = []
			cat = Restaurant.approved.where('typee ~* ?' , params[:name]).uniq
---
SELECT DISTINCT "restaurants".* FROM "restaurants" WHERE (typee ~* 'restaurant')