app/controllers/users_controller.rb

	def create
		em = params[:user][:email].downcase
		if user = User.find_by_email(em)
			render json: {'message' => 'Already signedup!'} , status: :ok
		else
			p params
			if params[:user][:password].blank?
				ident = params[:user][:identities_attributes]['0']
				p ident
				if ident[:provider].present? && ident[:uid].present? && ident[:token].present?
					if user = User.new(user_params)
						user.email = em
						user.save
						user.update(verified: true)
						user.generate_referral_code
						user.save
						cred = Credit.create(user_id: user.id)
						if params[:user][:referal_code].present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "muhammad.tayyabmukhtar@yahoo.com"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
UPDATE "users" SET "name" = $1, "username" = $2, "location" = $3, "gender" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", "Muhammad Tayyab"], ["username", "Tayyab"], ["location", "Lahore"], ["gender", 0], ["updated_at", "2016-11-16 14:33:31.786104"], ["id", 217]]
INSERT INTO "credits" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 217], ["created_at", "2016-11-16 14:33:31.836802"], ["updated_at", "2016-11-16 14:33:31.836802"]]
SELECT  1 AS one FROM "users" WHERE "users"."referal_code" = $1 LIMIT 1  [["referal_code", "Tayyab_2299"]]

				cred = Credit.create(user_id: user.id)
				identity = Identity.new(:provider => 'Dishcuss' , :user_id => user.id)
				identity.generate_token
			    identity.save
---
INSERT INTO "identities" ("provider", "user_id", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["provider", "Dishcuss"], ["user_id", 217], ["token", "2f8071cc86f9b8c06c58755084ffd246"], ["created_at", "2016-11-16 14:33:31.864915"], ["updated_at", "2016-11-16 14:33:31.864915"]]

	def signin
		p params
		em = params[:user][:email].downcase
		if em.present? && (em.length > 1 )
			p "Email Present"
			if user = User.find_by_email(em)
				p "User Found BY Email"
				if params[:user][:password].blank?
					p "User Password Blank"
					ident = params[:user][:identities_attributes]['0']
					if ident[:provider].present? && ident[:uid].present? && ident[:token].present?
						p "Identity Present"
						if identity = user.identities.find_by_provider(ident[:provider])
							p "Found BY Provider"
							if identity.uid == ident[:uid]
								user.identities.each do |iden|
									iden.update_attributes(:token => nil)
								end
								identity.update_attributes(:token => ident[:token])
								p identity.inspect
					    		render json: identity , root: "user", serializer: UserTokenSerializer, status: :ok
					    	else
					    		render json: {'message' => 'Invalid user id'} , status: :unprocessable_entity
					    	end
						else
							user.identities.each do |iden|
								iden.update_attributes(:token => nil)
							end
							identity = user.identities.create(user_signin_params["identities_attributes"]['0'])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "sajidsdfsfdsjfkdsali@test.com"]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = 'sajidsdfsfdsjfkdsali@test.com' LIMIT 1
SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = $1 AND "identities"."provider" = $2 LIMIT 1  [["user_id", 216], ["provider", "Facebook"]]
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = $1  [["user_id", 216]]
UPDATE "identities" SET "token" = $1, "updated_at" = $2 WHERE "identities"."id" = $3  [["token", nil], ["updated_at", "2016-11-09 19:11:17.831114"], ["id", 213]]
INSERT INTO "identities" ("provider", "uid", "url", "token", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

						user.save
						user.generate_referral_code
						user.save
						cred = Credit.create(user_id: user.id)
						if params[:user][:referal_code].present?
---
INSERT INTO "credits" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-11-09 19:09:11.706030"], ["updated_at", "2016-11-09 19:09:11.706030"]]
SELECT  1 AS one FROM "users" WHERE "users"."referal_code" = $1 LIMIT 1  [["referal_code", "tayyab064_614"]]

	def version
		c = Version.last
---
SELECT  "versions".* FROM "versions"  ORDER BY "versions"."id" DESC LIMIT 1